1tontech.angular-material
akamud.vscode-theme-onedark
alefragnani.project-manager
alexiv.vscode-angular2-files
Angular.ng-template
asvetliakov.vscode-neovim
bungcip.better-toml
christian-kohler.path-intellisense
codemooseus.vscode-devtools-for-chrome
CoenraadS.bracket-pair-colorizer-2
cyrilletuzi.angular-schematics
dbaeumer.vscode-eslint
dotcypress.console-log
dsobotta.godot-rust-vscode
dustypomerleau.rust-syntax
EditorConfig.EditorConfig
eg2.tslint
esbenp.prettier-vscode
evgeniypeshkov.syntax-highlighter
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
geequlim.godot-tools
hbenl.vscode-test-explorer
IgorSbitnev.error-gutters
infinity1207.angular2-switcher
john-crowson.angular-file-changer
johnpapa.Angular2
johnpapa.vscode-peacock
JScearcy.rust-doc-viewer
Lamarcke.kanagawa-black
loiane.angular-extension-pack
lorenzopirro.rust-flash-snippets
ms-vscode.test-adapter-converter
ms-vscode.vscode-typescript-tslint-plugin
nyxiative.rust-and-friends
obenjiro.arrr
PKief.material-icon-theme
PolyMeilex.rust-targets
qufiwefefwoyn.kanagawa
quicktype.quicktype
rbbit.typescript-hero
rctay.karma-problem-matcher
rust-lang.rust-analyzer
segerdekort.angular-cli
serayuzgur.crates
SimonTest.simontest
steoates.autoimport
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-portuguese-brazilian
stringham.move-ts
Swellaby.rust-pack
Swellaby.vscode-rust-test-adapter
usernamehw.errorlens
vadimcn.vscode-lldb
vscode-icons-team.vscode-icons
vscodevim.vim
wayou.vscode-todo-highlight
ZhangYue.rust-mod-generator
zhuangtongfa.material-theme
